Revit 2026 API

# MEPAnalyticalNode Properties

---

The MEPAnalyticalNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Id | The identity used in the MEPAnalyticalSegment |
|  | IsFlowBlocked | Is the flow blocked at this analytical node? |
|  | IsFocalNode | Is this node a focal point of multiple branches? |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Location | The location of this node. |

#### Reference

MEPAnalyticalNode Class

Autodesk.Revit.DB.Analysis Namespace